-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: localhost    Database: kreble
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product` (
  `prd_no` varchar(10) NOT NULL,
  `prd_name` varchar(45) NOT NULL,
  `prd_cata` varchar(15) NOT NULL,
  `prd_id` varchar(20) NOT NULL,
  `prd_meter` varchar(16) DEFAULT NULL,
  `prd_note` varchar(30) DEFAULT NULL,
  `prd_price` int NOT NULL,
  `prd_size` varchar(10) DEFAULT NULL,
  `prd_color` varchar(20) DEFAULT NULL,
  `prd_date` date NOT NULL,
  `prd_create` varchar(20) NOT NULL,
  `prd_qaul` varchar(10) NOT NULL,
  `prd_as` varchar(50) DEFAULT NULL,
  `prd_qant` int NOT NULL DEFAULT '0',
  `prd_img` text NOT NULL,
  `prd_content` text,
  PRIMARY KEY (`prd_no`),
  KEY `prd_id_idx` (`prd_id`),
  CONSTRAINT `prd_id` FOREIGN KEY (`prd_id`) REFERENCES `user` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product`
--

LOCK TABLES `product` WRITE;
/*!40000 ALTER TABLE `product` DISABLE KEYS */;
INSERT INTO `product` VALUES ('b0001','축구공','축구공','testid','PU','Best quality ball',50000,'중','빨강','2023-04-05','Nike','검사완료','John',100,'b0001.jpg','이 축구공은 최고의 품질로 제작되었습니다.'),('b0002','축구공','축구공','y222','TPU','Good quality ball',30000,'소','노랑','2023-04-05','Adidas','검사중','Mike',50,'b0002.jpg','이 축구공은 좋은 품질로 제작되었습니다.'),('b0003','축구공','축구공','testid','PU','2023-03-18 등록',20000,'소','파랑','2023-04-05','미즈노','검사예정','김미영',80,'b0003.jpg','FIFA 공입니다.'),('b0004','축구공','축구공','testid','PVC','-',150000,'대','노란색','2023-03-01','Nike','검사완료','testid',50,'b0004.jpg','축구공입니다.'),('b0005','축구공','축구공','testid','PU','none',50000,'중','검정','2023-04-05','Nike','검사중','testid',50,'b0005.jpg','축구공 상세설명'),('b0007','축구공','축구공','testid','PU','none',45000,'대','초록','2023-04-05','Puma','검사예정','testid',100,'b0007.jpg','축구공 상세설명'),('b0008','축구공','축구공','gkwlak','PU','1111',15000,'대','파랑','2023-04-05','Kappa','검사완료','gkwlak',100,'b0008.jpg','축구공입니다.'),('b0009','축구공','축구공','gkwlak','PU','',20000,'소','빨강','2023-04-05','Nike','검사완료','gkwlak',50,'b0009.jpg','축구공입니다.'),('b0010','축구공','축구공','gkwlak','PVC','',10000,'중','검정','2023-04-05','Adidas','검사중','gkwlak',80,'b0010.jpg','축구공입니다.'),('b0011','축구공','축구공','testid','재질1','비고1',10000,'대','빨강','2023-04-01','제조사1','검사중','제조사1',50,'b0011.jpg','축구공 상세정보1'),('b0013','축구공1','축구공','testid','재질1','비고1',10000,'대','빨강','2023-04-01','제조사1','검사중','제조사1',10,'b0013.jpg','축구공1 상세 내용'),('b0014','축구공2','축구공','rkskek','재질2','비고2',15000,'중','파랑','2023-04-02','제조사2','검사예정','제조사2',5,'b0014.jpg','축구공2 상세 내용'),('b0015','축구공3','축구공','gkwlak','재질3','비고3',20000,'소','초록','2023-04-03','제조사3','검사완료','제조사3',20,'b0015.jpg','축구공3 상세 내용'),('b0016','축구공1','축구공','gkwlak','재질1','비고1',10000,'5번','흰색','2023-04-11','제조사1','검사중','제조사1',50,'b0016.jpg','내용1'),('b0017','축구공2','축구공','testid','재질2','비고2',20000,'5번','검정색','2023-04-12','제조사2','검사예정','제조사2',30,'b0017.jpg','내용2'),('b0018','축구공6','축구공','testid','재질6','비고6',10000,'소','파랑','2023-03-01','제조사1','검사완료','제조사1',25,'b0018.jpg','축구공6 상세 내용입니다.'),('b0019','축구공7','축구공','rkskek','재질7','비고7',11000,'중','초록','2023-03-05','제조사2','검사중','제조사2',30,'b0019.jpg','축구공7 상세 내용입니다.'),('b0020','축구공8','축구공','gkwlak','재질8','비고8',12000,'대','빨강','2023-03-10','제조사3','검사예정','제조사3',35,'b0020.jpg','축구공8 상세 내용입니다.'),('b0021','축구공9','축구공','testid','재질9','비고9',13000,'소','노랑','2023-03-15','제조사4','검사완료','제조사4',40,'b0021.jpg','축구공9 상세 내용입니다.'),('b0022','축구공10','축구공','rkskek','재질10','비고10',14000,'중','회색','2023-03-20','제조사5','검사중','제조사5',45,'b0022.jpg','축구공10 상세 내용입니다.'),('e0001','기타용품','기타용품','rmfotj','합성소재','2023-03-17 등록',30000,'중','노랑','2023-04-05','푸마','검사완료','이영희',150,'e0001.jpg','펌프가 내장되어있습니다.'),('e0002','수건','기타용품','testid','나일론','용도: 수건',90000,'대','블랙','2023-04-05','삼성','검사중','testid',20,'e0002.jpg','잠자는 호랑이를 깨우지 마세요'),('e0003','수건','기타용품','testid','나일론','세일 진행중',25000,'소','검정','2023-04-05','Puma','검사중','이지은',80,'e0003.jpg','축구용 교환용 배낭입니다.'),('e0004','기타용품','기타용품','testid','우레탄','네오프렌 소재',40000,'중','검정','2023-04-05','A회사','검사완료','testid',100,'e0004.jpg','본 제품은 좋은 신발입니다.'),('e0005','기타','기타용품','testid','폴리에스터','방수, 방풍',50000,'소','회색','2023-04-05','B회사','검사완료','testid',150,'e0005.jpg','본 제품은 선수들의 필수품입니다.'),('e0008','기타1111','기타용품','testid','폴리에스터','안정성 높음',60000,'소','초록','2023-04-05','E회사','검사완료','testid',170,'e0008.jpg','본 제품은 필기구입니다.'),('e0009','기타','기타용품','testid','폴리에스터','내구성 높음',70000,'대','회색','2023-04-05','F회사','검사완료','testid',190,'e0009.jpg','본 제품은 선반입니다.'),('e0010','기타','기타용품','testid','나일론','방수',90000,'소','노랑','2023-04-05','G회사','검사완료','testid',80,'e0010.jpg','본 제품은 방수가방입니다.'),('e0011','기타용품','기타용품','testid','재질4','비고4',20000,'대','노랑','2023-04-04','제조사4','검사중','제조사4',40,'e0011.jpg','기타용품 상세정보1'),('e0018','기타용품1','기타용품','testid','재질1','비고1',10000,'대','빨강','2023-04-11','제조사1','검사중','제조사1',50,'e0018.jpg','내용1'),('e0019','기타용품2','기타용품','gkwlak','재질2','비고2',20000,'중','파랑','2023-04-12','제조사2','검사예정','제조사2',30,'e0019.jpg','내용2'),('e0020','기타용품3','기타용품','rmfotj','재질3','비고3',30000,'소','노랑','2023-04-13','제조사3','검사완료','제조사3',20,'e0020.jpg','내용3'),('e0021','기타용품4','기타용품','gkwlak','재질4','비고4',40000,'대','초록','2023-04-14','제조사4','검사중','제조사4',40,'e0021.jpg','내용4'),('e0022','기타용품5','기타용품','rmfotj','재질5','비고5',50000,'중','주황','2023-04-15','제조사5','검사완료','제조사5',10,'e0022.jpg','내용5'),('s0001','축구화','축구화','y222','PU','Best quality shoes',150000,'중','검정','2023-04-05','Nike','검사완료','John',20,'s0001.jpg','이 축구화는 최고의 품질로 제작되었습니다.'),('s0002','축구화','축구화','gkwlak','합성피혁','2023-03-16 등록',100000,'대','검정','2023-04-05','나이키','검사중','김철수',50,'s0002.jpg','스파이크 끝이 엣지입니다.'),('s0003','축구화','축구화','rmfotj','합성피혁','none',120000,'중','검정','2023-04-05','Adidas','검사중','testid',30,'s0003.jpg','축구화 상세설명'),('s0004','축구화','축구화','rmfotj','합성피혁','none',150000,'소','노랑','2023-04-05','Nike','검사완료','testid',40,'s0004.jpg','축구화 상세설명'),('s0005','축구화','축구화','rmfotj','합성피혁','none',90000,'대','초록','2023-04-05','Puma','검사예정','testid',20,'s0005.jpg','축구화 상세설명'),('s0006','축구화','축구화','rmfotj','인조가죽','신발끈 포함',125000,'소','검정','2023-04-05','나이키','검사완료','rmfotj',150,'s0006.jpg','최신 기술을 담은 나의 축구화'),('s0007','축구화','축구화','rmfotj','합성피혁','디자인 다양',90000,'대','회색','2023-04-05','아디다스','검사중','rmfotj',180,'s0007.jpg','국내 최고 인기 브랜드의 축구화'),('s0008','축구화1111','축구화','rmfotj','가죽','내구성 뛰어남',220000,'소','빨강','2023-04-05','푸마','검사예정','rmfotj',90,'s0008.jpg','합리적인 가격과 우수한 품질을 가진 축구화'),('s0009','축구화','축구화','rmfotj','합성피혁','선택 다양',135000,'중','흰색','2023-04-05','아디다스','검사완료','rmfotj',120,'s0009.jpg','슈퍼히어로 같은 능력을 가진 축구화'),('s0010','축구화','축구화','rmfotj','합성가죽','빠른 발목 움직임',175000,'대','초록','2023-04-05','나이키','검사중','rmfotj',200,'s0010.jpg','전문가들이 자신 있게 추천하는 축구화'),('s0011','축구화','축구화','rkskek','재질2','비고2',50000,'중','파랑','2023-04-02','제조사2','검사예정','제조사2',30,'s0011.jpg','축구화 상세정보1'),('s0012','축구화 B','축구화','rkskek','합성피혁','편안한 착화감을 제공합니다.',80000,'260','검정','2023-03-01','XYZ Sports','검사중','XYZ Sports랑 동일하게',30,'s0011.jpg','물품 상세정보 2에 대한 상세 설명입니다.'),('s0013','축구화1','축구화','testid','재질1','비고1',100000,'대','검정','2023-03-15','제조사1','검사중','제조사1',5,'s0013.jpg','축구화1 상세 내용입니다.'),('s0014','축구화2','축구화','rkskek','재질2','비고2',90000,'중','노랑','2023-02-28','제조사2','검사예정','제조사2',8,'s0014.jpg','축구화2 상세 내용입니다.'),('s0015','축구화3','축구화','gkwlak','재질3','비고3',80000,'소','빨강','2023-04-05','제조사3','검사완료','제조사3',12,'s0015.jpg','축구화3 상세 내용입니다.'),('s0016','축구화1','축구화','gkwlak','재질1','비고1',50000,'250mm','검정색','2023-04-11','제조사1','검사중','제조사1',20,'0016.jpg','내용1'),('s0017','축구화2','축구화','testid','재질2','비고2',60000,'260mm','빨간색','2023-04-12','제조사2','검사예정','제조사2',10,'0017.jpg','내용2'),('s0018','testid','축구화','testid','testid','111',1111,'testid','testid','2023-04-11','testid','testid','testid',111,'s0018.jpg','testid'),('u0001','유니폼','유니폼','rmfotj','면100%','2023-03-15',50000,'소','빨강','2023-04-05','뉴발란스','검사완료','홍길동',100,'u0001.jpg','팀명과 선수명이 적혀있습니다.'),('u0002','유니폼','유니폼','testid','폴리에스테르','용도: 축구용',250000,'소','레드','2023-04-05','나이키','검사완료','testid',150,'u0002.jpg','팀 이름과 로고가 있는 고급 유니폼'),('u0003','유니폼','유니폼','testid','폴리에스터 100%','할인 판매',45000,'대','노랑','2023-04-05','Adidas','검사예정','박영희',50,'u0003.jpg','최신 디자인의 축구 유니폼입니다.'),('u0004','유니폼','유니폼','rkskek','default','default',45000,'대','파랑','2022-12-31','Nike','검사완료','rkskek',100,'u0004.jpg','이 제품은 더 좋아지지 않아요.'),('u0005','유니폼','유니폼','rkskek','default','default',60000,'중','빨강','2022-12-31','Adidas','검사중','rkskek',150,'u0005.jpg','이 제품은 더 좋아지지 않아요.'),('u0006','유니폼','유니폼','rkskek','default','default',55000,'소','노랑','2022-12-31','Puma','검사완료','rkskek',200,'u0006.jpg','이 제품은 더 좋아지지 않아요.'),('u0007','유니폼','유니폼','rkskek','default','default',50000,'대','검정','2022-12-31','Nike','검사예정','rkskek',120,'u0007.jpg','이 제품은 더 좋아지지 않아요.'),('u0008','유니폼','유니폼','rkskek','default','default',65000,'소','초록','2022-12-31','Adidas','검사완료','rkskek',80,'u0008.jpg','이 제품은 더 좋아지지 않아요.'),('u0009','유니폼','유니폼','rkskek','default','default',70000,'중','파랑','2022-12-31','Nike','검사중','rkskek',90,'u0009.jpg','이 제품은 더 좋아지지 않아요.'),('u0010','유니폼','유니폼','rkskek','default','default',60000,'대','빨강','2022-12-31','Puma','검사완료','rkskek',110,'u0010.jpg','이 제품은 더 좋아지지 않아요.'),('u0011','유니폼','유니폼','gkwlak','재질3','비고3',70000,'소','초록','2023-04-03','제조사3','검사완료','제조사3',20,'u0011.jpg','유니폼 상세정보1'),('u0012','유니폼 C','유니폼','gkwlak','폴리에스터 100%','공식 대회용 유니폼입니다.',50000,'M','노랑','2023-03-15','PQR Sports','검사예정','PQR Sports랑 동일하게',20,'u0011.jpg','물품 상세정보 3에 대한 상세 설명입니다.'),('u0013','유니폼1','유니폼','testid','재질1','비고1',70000,'대','파랑','2023-03-01','제조사1','검사중','제조사1',10,'u0013.jpg','유니폼1 상세 내용입니다.'),('u0014','유니폼2','유니폼','rkskek','재질2','비고2',80000,'중','빨강','2023-04-03','제조사2','검사예정','제조사2',6,'u0014.jpg','유니폼2 상세 내용입니다.'),('u0015','유니폼3','유니폼','gkwlak','재질3','비고3',90000,'소','노랑','2023-02-25','제조사3','검사완료','제조사3',8,'u0015.jpg','유니폼3 상세 내용입니다.'),('u0018','유니폼1','유니폼','testid','재질1','비고1',10000,'대','색상1','2023-04-10','제조사1','검사중','제조사1',10,'u0018.jpg','내용1'),('u0019','유니폼2','유니폼','rkskek','재질2','비고2',15000,'중','색상2','2023-04-09','제조사2','검사예정','제조사2',20,'u0019.jpg','내용2'),('u0020','유니폼3','유니폼','gkwlak','재질3','비고3',20000,'소','색상3','2023-04-08','제조사3','검사완료','제조사3',30,'u0020.jpg','내용3');
/*!40000 ALTER TABLE `product` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-04-19 17:10:33
